# #1
# 1
# #2
# 1
# 1 1
# #3
# 1
# 1 1
# 1 2 1
# #4
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# #5
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# #6
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# 1 5 10 10 5 1
# #7
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# 1 5 10 10 5 1
# 1 6 15 20 15 6 1
# #8
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# 1 5 10 10 5 1
# 1 6 15 20 15 6 1
# 1 7 21 35 35 21 7 1
# #9
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# 1 5 10 10 5 1
# 1 6 15 20 15 6 1
# 1 7 21 35 35 21 7 1
# 1 8 28 56 70 56 28 8 1
# #10
# 1
# 1 1
# 1 2 1
# 1 3 3 1
# 1 4 6 4 1
# 1 5 10 10 5 1
# 1 6 15 20 15 6 1
# 1 7 21 35 35 21 7 1
# 1 8 28 56 70 56 28 8 1
# 1 9 36 84 126 126 84 36 9 1


file = open("./SWEA/D2/파스칼의삼각형.txt", "r")

input = file.readline

t = int(input())

for tc in range(1, t + 1) : 
	n = int(input())

	tri = [[1] for _ in range(n)]

	for i in range(1, n) :
		for j in range(1, i + 1) :
			if j == len(tri[i-1]) : 
				tri[i].append(1)
			else : 
				tri[i].append(tri[i-1][j-1] + tri[i-1][j])

	print("#%d" % tc)
	for tr in tri : 
		for t in tr : 
			print(t, end = " ")
		print()

file.close()